app/controllers/players_controller.rb

INSERT INTO "players" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Naveen"], ["last_name", "Kumar"], ["created_at", "2017-10-29 16:40:41.688955"], ["updated_at", "2017-10-29 16:40:41.688955"]]
---
    def create
    player = Player.new(player_params)

    if player.save

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
def show
       @player = Player.find(params[:id])

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
def edit
   @player = Player.find(params[:id])

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
UPDATE "players" SET "last_name" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["last_name", "sirji"], ["updated_at", "2017-11-13 15:29:31.954368"], ["id", 15]]
---
def update
   player = Player.find(params[:id])

   if player.update(player_params)

SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT ?  [["id", 20], ["LIMIT", 1]]
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 20]]
---
def destroy
  player = Player.find(params[:id])
  player.destroy